app/controllers/books_controller.rb

  def create
  	@book = Book.new(book_params)
  	@book.user_id = current_user.id
  	if @book.save
  		 redirect_to book_path(@book.id), notice: "Book was successfully created."
  	else
      @user = current_user
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "代々木"], ["body", "上原"], ["created_at", "2020-06-30 06:08:18.992143"], ["updated_at", "2020-06-30 06:08:18.992143"], ["user_id", 6]]
SELECT "books".* FROM "books"

  def update
  	@book = Book.find(params[:id])
  	if @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "ああああああ"], ["updated_at", "2020-07-04 11:46:07.524031"], ["id", 2]]