app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users"
UPDATE "users" SET "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", ""], ["profile_image_id", nil], ["updated_at", "2020-07-05 09:08:57.126152"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])
    @users = User.all
    if @user.update(user_params)